Repository: Andoni227/Renard-SwiftUI
Catalog: Renard 2.0/Resources/Localizables/Localizable.xcstrings
Source language: es_419
Languages: en, ko, pt_br, pt_pt

# accept
source: Aceptar
en: Ok
ko: 확인
pt_br: Ok
pt_pt: Ok

# camera
source: Cámara
en: Camera
ko: 카메라
pt_br: Câmera
pt_pt: Câmera

# camera_name
source: Nombre de la cámara
en: Camera name
ko: 카메라 이름
pt_br: Nome da câmera
pt_pt: Nome da câmara

# camera_permission
source: La aplicación requiere acceso a la galería para funcionar 😿
en: The application requires access to the gallery to function 😿
ko: 앱이 갤러리 접근 권한이 필요합니다 😿
pt_br: O aplicativo requer acesso à galeria para funcionar 😿
pt_pt: A aplicação requer acesso à galeria para funcionar 😿

# cancel
source: Cancelar
en: Cancel
ko: 취소

# closeApp
source: Mantén la app abierta
en: Keep the app open
ko: 앱을 열어 두세요
pt_br: Mantenha o app aberto
pt_pt: Mantenha a aplicação aberta

# Copy
source: Copiar
en: Copy
ko: 복사

# delete_after_save
source: Eliminar imágenes originales después de guardar
en: Delete original images after saving
ko: 저장 후 원본 이미지 삭제
pt_br: Excluir imagens originais após salvar
pt_pt: Eliminar imagens originais após guardar

# delete_after_save_one
source: Eliminar imagen original después de guardar
en: Delete original image after saving
ko: 저장 후 원본 이미지 삭제
pt_br: Excluir imagem original após salvar
pt_pt: Eliminar imagem original após guardar

# deleteAfterSave %@
source: Eliminar imágenes originales después de guardar (%@)
en: Delete original images after saving (%@)
ko: 저장 후 원본 이미지 삭제 (%@)
pt_br: Excluir imagens originais após salvar (%@)
pt_pt: Eliminar imagens originais após guardar (%@)

# downloadFailed
source: No se pudo descargar la imagen original...
en: Failed to download the original image...
ko: 원본 이미지 다운로드 실패...
pt_br: Falha ao baixar a imagem original...
pt_pt: Falha ao descarregar a imagem original...

# downloading
source: Descargando...
en: Downloading...
ko: 다운로드 중...
pt_br: Baixando...
pt_pt: A descarregar...

# downloadingFromIcloud %lf%%
source: Descargando vídeo desde iCloud… %lf%%
en: Downloading video from iCloud… %lf%%
ko: iCloud에서 비디오 다운로드 중 %lf%%
pt_br: Baixando vídeo do iCloud… %lf%%
pt_pt: A descarregar vídeo do iCloud… %lf%%

# downloadingFromIcloud %lld%%
source: Descargando video desde iCloud… %lld%%
en: Downloading video from iCloud… %lld%%
ko: iCloud에서 비디오 다운로드 중 %lld%%
pt_br: Baixando vídeo do iCloud… %lld%%
pt_pt: A descarregar vídeo do iCloud… %lld%%

# export
source: Exportar
en: Export
ko: 내보내다

# exportComplete
source: Exportación completada
en: Export completed
ko: 내보내기 완료
pt_br: Exportação concluída
pt_pt: Exportação concluída

# exportingVideo %lf%%
source: Exportando… %lf%%
en: Exporting… %lf%%
ko: 비디오 내보내는 중 %lf%%
pt_br: Exportando vídeo… %lf%%
pt_pt: A exportar vídeo… %lf%%

# exportingVideo %lld%%
source: Exportando vídeo... %lld%%
en: Exporting... %lld%%
ko: 비디오 내보내는 중 %lld%%
pt_pt: A exportar vídeo… %lld%%

# ExportOptions
source: Ajustes de exportación
en: Export Settings
ko: 내보내기 설정
pt_br: Ajustes de Exportação
pt_pt: Ajustes de Exportação

# file
source: Archivo
en: File
ko: 파일
pt_br: Arquivo
pt_pt: Ficheiro

# fix_date_alert
source: La fecha de las imágenes se actualizará usando la fecha guardada en el EXIF
en: The date of the images will be updated using the date stored in the EXIF
ko: 이미지의 날짜가 EXIF에 저장된 날짜를 사용하여 업데이트됩니다
pt_br: A data das imagens será atualizada usando a data armazenada no EXIF.
pt_pt: A data das imagens será atualizada usando a data armazenada no EXIF.

# fixDatesComplete
source: Fechas actualizadas
en: Dates updated
ko: 날짜 업데이트됨
pt_br: Datas atualizadas
pt_pt: Datas atualizadas

# Format
source: Formato de archivo
en: File Format
ko: 파일 형식
pt_br: Formato de arquivo
pt_pt: Formato de ficheiro

# imagesAlreadyHEIF
source: Estas imagenes ya están comprimidas, elige otro formato, por favor
en: These images are already compressed, please choose another format.
ko: 이미지가 이미 압축되었습니다. 다른 형식을 선택해주세요.
pt_br: Essas imagens já estão comprimidas, por favor escolha outro formato.
pt_pt: Estas imagens já estão comprimidas. Por favor, escolha outro formato.

# importingVideo
source: Importando…
en: Importing...
ko: 가져오는 중…
pt_br: mportando…
pt_pt: A importar…

# InfoScreen1Subtitle
source: Renard pemite convertir las imágenes de tu galería a formato HEIF, reduciendo considerablemente el peso de la imagen sin comprometer la calidad y conservando todos sus metadatos (ubicación, fecha y hora, información de la cámara, parámetros).
en: Renard allows you to convert images from your gallery to the HEIF format, significantly reducing the image's file size without compromising quality and preserving all its metadata (location, date and time, camera information, parameters).
ko: Renard를 사용하여 갤러리의 이미지를 HEIF 형식으로 변환하여 이미지 파일 크기를 크게 줄이고 품질을 저해하지 않으면서 위치, 날짜 및 시간, 카메라 정보, 매개변수 등 모든 메타데이터를 보존할 수 있습니다.
pt_br: O Renard permite converter imagens da sua galeria para o formato HEIF, reduzindo significativamente o tamanho do arquivo da imagem sem comprometer a qualidade e preservando todos os metadados (localização, data e hora, informações da câmera, parâmetros).
pt_pt: O Renard permite-lhe converter imagens da sua galeria para o formato HEIF, reduzindo significativamente o tamanho do ficheiro da imagem sem comprometer a qualidade e preservando todos os metadados (localização, data e hora, informações da câmara, parâmetros).

# InfoScreen1Title
source: ¿Para qué sirve Renard?
en: What is Renard used for?
ko: Renard는 무엇을 위해 사용되나요?
pt_br: Para que serve o Renard?
pt_pt: Para que serve o Renard?

# InfoScreen2Subtitle
source: Selecciona una o varias fotos desde la vista de galería, da clic en guardar y Renard convertirá las imágenes seleccionadas a HEIF, y las guardará en tu galería. Después te dará la opción de eliminar la imagen original para evitar tener dos fotos iguales.
en: Select one or several photos from the gallery view, click on save, and Renard will convert the selected images to HEIF and save them in your gallery. Afterward, you will have the option to delete the original image to avoid having two identical photos.
ko: 갤러리 뷰에서 하나 이상의 사진을 선택한 후 저장을 클릭하면 Renard가 선택한 이미지를 HEIF로 변환하여 갤러리에 저장합니다. 그 후에는 동일한 사진 두 장이 중복되는 것을 피하기 위해 원본 이미지를 삭제할 수 있습니다.
pt_br: Selecione uma ou várias fotos na visualização da galeria, clique em salvar e o Renard converterá as imagens selecionadas para HEIF e as salvará na sua galeria. Em seguida, você terá a opção de excluir a imagem original para evitar ter duas fotos idênticas.
pt_pt: Selecione uma ou várias fotos na vista de galeria, clique em guardar e o Renard irá converter as imagens selecionadas para HEIF e guardá-las na sua galeria. Posteriormente, terá a opção de eliminar a imagem original para evitar ter duas fotos idênticas.

# InfoScreen2Title
source: ¿Cómo se usa?
en: How to use?
ko: 사용 방법은?
pt_br: Como usar?
pt_pt: Como utilizar?

# InfoScreen3Subtitle
source: Las fotos eliminadas por Renard se guardan en la carpeta de eliminados de tu galería, si lo necesitas, desde ahí la puedes recuperar.
en: Photos deleted by Renard are stored in the 'deleted items' folder in your gallery. If needed, you can recover them from there.
ko: Renard에 의해 삭제된 사진은 갤러리의 '삭제된 항목' 폴더에 저장됩니다. 필요한 경우 거기서 복구할 수 있습니다.
pt_br: As fotos excluídas pelo Renard são armazenadas na pasta 'itens excluídos' da sua galeria. Se necessário, você pode recuperá-las de lá.
pt_pt: As fotos eliminadas pelo Renard são armazenadas na pasta 'itens eliminados' da sua galeria. Se necessário, pode recuperá-las a partir daí.

# InfoScreen3Title
source: Borré una foto original y quiero recuperarla
en: I deleted an original photo and want to recover it
ko: 원본 사진을 삭제하고 복구하려면
pt_br: Eu deletei uma foto original e quero recuperá-la
pt_pt: Eliminei uma foto original e quero recuperá-la

# InfoScreen4Subtitle
source: Las imágenes HEIF ya tienen una compresión lo suficientemente eficiente como para reducir aún más su peso. Por esa razón, no se muestran en la app.
en: HEIF images are already compressed efficiently enough to reduce their file size further. That's why they are not displayed in the app.
ko: HEIF 이미지는 이미 효율적으로 압축되어 파일 크기를 더 줄일 수 있기 때문에 앱에서 표시되지 않습니다.
pt_br: As imagens HEIF já estão comprimidas de forma eficiente o suficiente para reduzir ainda mais o tamanho do arquivo. Por isso, elas não são exibidas no aplicativo.
pt_pt: As imagens HEIF já estão comprimidas de forma suficientemente eficiente para reduzir ainda mais o tamanho do ficheiro. Por isso, não são exibidas na aplicação.

# InfoScreen4Title
source: ¿Por qué no se muestran todas mis fotos?
en: Why aren't all my photos displayed?
ko: 왜 내 모든 사진이 표시되지 않나요?
pt_br: Por que nem todas as minhas fotos são exibidas?
pt_pt: Porque é que nem todas as minhas fotos são exibidas?

# InfoScreen5Subtitle
source: Renard no recopila ningún tipo de dato, ni siquiera con fines estadísticos.
en: Renard does not collect any data, not even for statistical purposes.
ko: Renard는 어떠한 데이터도 수집하지 않으며 통계 목적으로조차 사용하지 않습니다.
pt_br: O Renard não coleta nenhum dado, nem mesmo para fins estatísticos.
pt_pt: O Renard não recolhe quaisquer dados, nem mesmo para fins estatísticos.

# InfoScreen5Title
source: ¿Mis datos están seguros?
en: Are my data safe?
ko: 내 데이터는 안전한가요?
pt_br: Meus dados estão seguros?
pt_pt: Os meus dados estão seguros?

# InfoScreen6Subtitle
source: Valorar Renard ⭐️⭐️⭐️⭐️⭐️
en: Rate Renard ⭐️⭐️⭐️⭐️⭐️
ko: Renard 평가하기 ⭐️⭐️⭐️⭐️⭐️
pt_br: Avalie o Renard ⭐️⭐️⭐️⭐️⭐️
pt_pt: Classifique o Renard ⭐️⭐️⭐️⭐️⭐️

# InfoScreen7Subtitle
source: Renard utiliza recursos de diversos artistas:
en: Renard uses resources from various artists:
ko: Renard는 다양한 아티스트의 자료를 활용합니다:
pt_br: O Renard utiliza recursos de vários artistas:
pt_pt: O Renard utiliza recursos de vários artistas:

# InfoScreen8Subtitle
source: Contacto ↗️
en: Contact ↗️
ko: 연락처 ↗️
pt_br: Contato ↗️

# InfoScreen9Subtitle
source: Política de privacidad ↗️
en: Privacy Policy ↗️
ko: 개인정보 처리방침 ↗️
pt_br: Política de Privacidade ↗️
pt_pt: Política de Privacidade ↗️

# LessCommonFormat
source: Formato menos común
en: Less common format
ko: 덜 일반적인 형식
pt_br: Formato menos comum
pt_pt: Formato menos comum

# limitedAccessWarning
source: Se detectaron fotos sin convertir, esto puede deberse a que no se otorgaron permisos completos a una o varias imágenes seleccionadas
en: Unconverted photos were detected. This may be due to incomplete permissions granted to one or more selected images.
ko: 변환되지 않은 사진이 감지되었습니다. 이는 선택한 하나 이상의 이미지에 전체 권한이 부여되지 않았기 때문일 수 있습니다.
pt_br: Foram detectadas fotos não convertidas. Isso pode ter ocorrido porque uma ou mais imagens selecionadas não receberam permissões completas.
pt_pt: Foram detetadas fotos não convertidas. Isto pode dever-se à falta de permissões completas para uma ou mais imagens selecionadas.

# limitSelectedImages
source: Para evitar tiempos de espera largos, considera seleccionar menos de 40 fotos
en: To avoid long waiting times, consider selecting less than 40 photos.
ko: 긴 대기 시간을 피하기 위해, 40개 미만의 사진을 선택해보세요.
pt_br: Para evitar longos tempos de espera, considere selecionar menos de 40 fotos.
pt_pt: Para evitar tempos de espera longos, considere selecionar menos de 40 fotos.

# loading
source: Cargando...
en: Loading...
ko: 로딩 중...
pt_br: Carregando...
pt_pt: A carregar...

# loadingLibrary
source: Cargando biblioteca...
en: Loading library...
ko: 라이브러리 불러오는 중...
pt_br: Carregando biblioteca...
pt_pt: A carregar biblioteca...

# MaxResPhoto
source: Foto de mayor resolución
en: Highest resolution photo
ko: 최고 해상도 사진
pt_br: Foto de resolução mais alta
pt_pt: Foto com a maior resolução

# MinusResPhoto
source: Foto de menor resolución
en: Lowest resolution photo
ko: 최저 해상도 사진
pt_br: Foto de resolução mais baixa
pt_pt: Foto com a menor resolução

# MostCommonFormat
source: Formato más común
en: Most common format
ko: 가장 일반적인 형식
pt_br: Formato mais comum
pt_pt: Formato mais comum

# openSettings
source: Abrir configuración
en: Open Settings
ko: 설정 열기
pt_br: Abrir Configurações
pt_pt: Abrir Definições

source: PhotosFormatPostFix
en: Photos
ko: 개

# preferences
source: Preferencias
en: Preferences
ko: 선호도
pt_br: Preferências
pt_pt: Preferências

# preferencesOption1
source: Eliminar imagenes originales de forma predeterminada
en: Delete original images by default
ko: 기본적으로 원본 이미지 삭제
pt_br: Excluir imagens originais por padrão
pt_pt: Eliminar imagens originais por padrão

# preferencesOption2
source: Nivel de compresión de imágenes
en: Image compression level
ko: 이미지 압축 수준
pt_br: Nível de compressão de imagens
pt_pt: Nível de compressão de imagens

# preferencesOption2_0
source: Alto
en: High
ko: 최소

# preferencesOption2_1
source: Equilibrado
en: Balanced
ko: 균형

# preferencesOption2_2
source: Bajo
en: Low
ko: 기본
pt_br: Baixo
pt_pt: Baixo

# preferencesOption2_3
source: Sin compresión
en: Uncompressed
ko: 비압축
pt_br: Sem compressão
pt_pt: Sem compressão

# preferencesOption2_6
source: Seleccionar un nivel de compresión muy alto puede provocar que se pierdan algunos colores en zonas obscuras y puede no ser efectivo en imagenes muy pequeñas, ¿Deseas continuar?
en: Selecting a very high compression level may cause some colors to be lost in dark areas and may not be effective on very small images. Do you want to continue?
ko: 매우 높은 압축 수준을 선택하면 어두운 영역에서 일부 색상이 손실될 수 있으며 매우 작은 이미지에서 효과적이지 않을 수 있습니다. 계속하시겠습니까?
pt_br: Selecionar um nível de compressão muito alto pode fazer com que algumas cores sejam perdidas em áreas escuras e pode não ser eficaz em imagens muito pequenas. Deseja continuar?
pt_pt: Selecionar um nível de compressão muito alto pode fazer com que algumas cores sejam perdidas em áreas escuras e pode não ser eficaz em imagens muito pequenas. Deseja continuar?

# preferencesOption3
source: Borrar caché
en: Clear cache
ko: 캐시 삭제
pt_br: Limpar cache
pt_pt: Limpar cache

# preferencesOption4
source: Al dar dar click en un mapa abrir:
en: When tapping a map, open:
ko: 지도를 탭하면 열기:
pt_br: Ao tocar em um mapa, abrir:
pt_pt: Ao clicar num mapa, abrir:

# requestPermission
source: Permisos requeridos
en: Required Permissions
ko: 필요한 권한
pt_br: Permissões requeridas
pt_pt: Permissões necessárias

# retry
source: Reintentar
en: Retry
ko: 다시 시도
pt_br: Tentar novamente
pt_pt: Tentar novamente

# save
source: Guardar
en: Save
ko: 저장
pt_br: Salvar

# saveAVIFAlert
source: Esta imagen está en formato AVIF el cual es más eficiente que HEIF, la conversión podría resultar en una imagen más pesada pero a su vez más compatible, ¿deseas continuar?
en: This image is in AVIF format, which is more efficient than HEIF. The conversion could result in a heavier image but at the same time more compatible. Do you want to continue?
ko: 이 이미지는 AVIF 형식으로 되어 있으며, 이는 HEIF보다 효율적입니다. 변환 과정에서 더 무거운 이미지가 될 수 있지만, 동시에 더 호환성이 있을 수 있습니다. 계속하시겠습니까?
pt_br: Esta imagem está no formato AVIF, que é mais eficiente que o HEIF. A conversão pode resultar em uma imagem mais pesada, mas ao mesmo tempo mais compatível. Deseja continuar?
pt_pt: Esta imagem está em formato AVIF, que é mais eficiente do que HEIF. A conversão poderá resultar numa imagem mais pesada, mas ao mesmo tempo mais compatível. Deseja continuar?

# savedMetadata
source: Metadatos guardados
en: Saved metadata
ko: 저장된 메타데이터
pt_br: Metadatos salvos
pt_pt: Metadatos salvos

# saveMetadataAlert
source: Elige un nombre para esta cámara, se guardaran los metadatos del modelo y marca de la cámara, los cuales podrás usar después para aplicarlos a otras imagenes
en: Choose a name for this camera, the model and brand metadata will be saved, which you can later use to apply to other images
ko: 이 카메라에 이름을 선택하세요. 카메라 모델 및 브랜드 메타데이터가 저장되며, 이를 나중에 다른 이미지에 적용할 수 있습니다
pt_br: Escolha um nome para esta câmera, os metadados do modelo e marca da câmera serão salvos, os quais você poderá usar posteriormente para aplicar a outras imagens
pt_pt: Escolha um nome para esta câmera, os metadados do modelo e marca da câmera serão salvos, os quais você poderá usar posteriormente para aplicar a outras imagens

# saveMetadataBtn
source: Guardar metadatos
en: Save metadata
ko: 메타데이터 저장하기
pt_br: Salvar metadados
pt_pt: Salvar metadados

# saveSuccess
source: ¡Imagen guardada con éxito!
en: Image saved successfully!
ko: 이미지가 성공적으로 저장되었습니다!
pt_br: Imagem salva com sucesso!
pt_pt: Imagem guardada com sucesso!

# selectTxt
source: Seleccionar
en: Select
ko: 선택
pt_br: Selecionar
pt_pt: Selecionar

# StatisticsScreenTitle
source: Estadisticas de la galería
en: Gallery statistics
ko: 갤러리 통계
pt_br: Estatísticas da galeria
pt_pt: Estatísticas da galeria

# TotalPhotos
source: Fotos totales
en: Total photos
ko: 전체 사진
pt_br: Total de fotos
pt_pt: Total de fotos

# unknown
source: Desconocido
en: Unknown
ko: 알 수 없는
pt_br: Desconhecido
pt_pt: Desconhecido

# unknownErrorExporting
source: Ocurrió un error al exportar
en: An error occurred while exporting.
ko: 내보내기 중 오류가 발생했습니다.
pt_br: Ocorreu um erro ao exportar.
pt_pt: Ocorreu um erro ao exportar.

# unknownErrorSaving
source: Ocurrió un error desconocido al guardar 🤨
en: An unknown error occurred while saving 🤨
ko: 저장 중 알 수 없는 오류가 발생했습니다 🤨
pt_br: Ocorreu um erro desconhecido ao salvar 🤨
pt_pt: Ocorreu um erro desconhecido ao guardar 🤨

# PhotosFormatPrefix
source: Fotos en
pt_br: Fotos em
pt_pt: Fotos em
